//При R=2
// (1,1)---- Точка не попала в область определения
// (-1,-1) ----- Точка не попала в область определения
// (1,-1) ---- Точка попала в область определения
// (-1,1)  ---- Точка попала в область определения
// (0,0)  ---- Точка попала в область определения
// (-1,-0) ---- Точка попала в область определения
// (1,0) ---- Точка попала в область определения
// (0,1) ---- Точка попала в область определения
// (0,-1) ---- Точка попала в область определения
#include<iostream>
#include<math.h>
using namespace std;
int main()
{
	setlocale(LC_ALL, ".1251");
	double x, y, R;
	cout << "Введите радиус окружности и координаты точки " << endl;
	cin >> R >> x >> y;
	if (((x > 0) && (y > 0)) || ((x < 0) && (y < 0)))
		cout << "Точка не попала в область определения! " << endl;
	else
		if ((x <= abs(R)) && (y <= abs(R)))
		{
			if ((((x + R) * (x + R) + (y - R) * (y - R)) >= R * R) && (((x - R) * (x - R) + (y + R) * (y + R)) >= R * R))
				cout << "Точка попала в область определения!" << endl;
			else
				cout << "Точка не попала в область определения! " << endl;
		}
		else
			cout << "Точка не попала в область определения! " << endl;
	system("pause");
			return 0;
}
